IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    *status = s_camera_sd_status;
}

uint32_t Camera_SDStorage_DebugSetBusWidth(uint32_t bus_width)
{
    uint32_t wait_result;
    uint32_t hal_bus_width;
    uint32_t start_ms;
    HAL_StatusTypeDef hal_status;

    if ((bus_width != 1U) && (bus_width != 4U))
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_INVALID;
        return CAMERA_SD_ERR_BUS_WIDTH_INVALID;
    }

    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_NOT_READY;
        return CAMERA_SD_ERR_BUS_WIDTH_NOT_READY;
    }

    s_bus_width_debug.requested_width = bus_width;
    ++s_bus_width_debug.attempt_count;

    wait_result = Camera_SDStorage_DebugWaitCardTransfer(1000U);
    if (wait_result != CAMERA_SD_OK)
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result =
            CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED;
        return CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED;
    }

    s_bus_width_debug.last_pre_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);
    hal_bus_width = (bus_width == 1U)
        ? SDIO_BUS_WIDE_1B
        : SDIO_BUS_WIDE_4B;
    start_ms = HAL_GetTick();
    hal_status = HAL_SD_ConfigWideBusOperation(
        &hsd_snapshot,
        hal_bus_width);
    s_bus_width_debug.last_operation_ms = HAL_GetTick() - start_ms;
    s_bus_width_debug.last_hal_status = (uint32_t)hal_status;
    s_bus_width_debug.last_hal_error = HAL_SD_GetError(&hsd_snapshot);
    s_bus_width_debug.last_post_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    if (hal_status == HAL_OK)
    {
        s_bus_width_debug.active_width = bus_width;
        ++s_bus_width_debug.success_count;
        s_bus_width_debug.last_result = CAMERA_SD_OK;
        return CAMERA_SD_OK;
    }

    ++s_bus_width_debug.error_count;
    s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED;
    return CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED;
}

void Camera_SDStorage_DebugPrintBusWidthStatus(void)
{
    /* LOG_RAW 使用项目现有 printf 风格串口输出，不依赖 CLI 私有函数。 */
    LOG_RAW("SD BUSWIDTH:\r\n");
    LOG_RAW("  supported=%lu\r\n", (unsigned long)s_bus_width_debug.supported);
    LOG_RAW("  requested_width=%lu\r\n", (unsigned long)s_bus_width_debug.requested_width);
    LOG_RAW("  active_width=%lu\r\n", (unsigned long)s_bus_width_debug.active_width);
    LOG_RAW("  attempt_count=%lu\r\n", (unsigned long)s_bus_width_debug.attempt_count);
    LOG_RAW("  success_count=%lu\r\n", (unsigned long)s_bus_width_debug.success_count);
    LOG_RAW("  error_count=%lu\r\n", (unsigned long)s_bus_width_debug.error_count);
    LOG_RAW("  last_result=%lu\r\n", (unsigned long)s_bus_width_debug.last_result);
    LOG_RAW("  last_hal_status=%lu\r\n", (unsigned long)s_bus_width_debug.last_hal_status);
    LOG_RAW("  last_hal_error=0x%08lX\r\n", (unsigned long)s_bus_width_debug.last_hal_error);
    LOG_RAW("  last_pre_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_pre_card_state);
    LOG_RAW("  last_post_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_post_card_state);
    LOG_RAW("  last_wait_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_card_state);
    LOG_RAW("  last_operation_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_operation_ms);
    LOG_RAW("  last_wait_operation_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_operation_ms);
    LOG_RAW("  last_wait_timeout_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_timeout_ms);
}

static void Camera_SDStorage_PrintReadBufferBytes(
    const char *field_name,
    const uint8_t *buffer,
    uint32_t length)
{
    uint32_t index;

    LOG_RAW("  %s=", field_name);
    for (index = 0U; index < length; ++index)
    {
        LOG_RAW(
            (index == 0U) ? "%02lX" : " %02lX",
            (unsigned long)buffer[index]);
    }
    LOG_RAW("\r\n");
}

void Camera_SDStorage_DebugPrintReadRegDiag(void)
{
    const Camera_SDSdioRegSnapshot_t *before_wait =
        &s_read_reg_diag.before_wait;
    const Camera_SDSdioRegSnapshot_t *before_read =
        &s_read_reg_diag.before_read;
    const Camera_SDSdioRegSnapshot_t *after_read =
        &s_read_reg_diag.after_read;
    uint32_t after_sta = after_read->sta;

    LOG_RAW("  read_before_wait_sta=0x%08lX\r\n", (unsigned long)before_wait->sta);
    LOG_RAW("  read_before_wait_clkcr=0x%08lX\r\n", (unsigned long)before_wait->clkcr);
    LOG_RAW("  read_before_wait_dctrl=0x%08lX\r\n", (unsigned long)before_wait->dctrl);
    LOG_RAW("  read_before_wait_dlen=%lu\r\n", (unsigned long)before_wait->dlen);
    LOG_RAW("  read_before_wait_dcount=%lu\r\n", (unsigned long)before_wait->dcount);
    LOG_RAW("  read_before_wait_fifocnt=%lu\r\n", (unsigned long)before_wait->fifocnt);
    LOG_RAW("  read_before_wait_power=0x%08lX\r\n", (unsigned long)before_wait->power);
    LOG_RAW("  read_before_wait_arg=0x%08lX\r\n", (unsigned long)before_wait->arg);
    LOG_RAW("  read_before_wait_cmd=0x%08lX\r\n", (unsigned long)before_wait->cmd);
    LOG_RAW("  read_before_wait_resp_cmd=0x%08lX\r\n", (unsigned long)before_wait->resp_cmd);

    LOG_RAW("  read_before_read_sta=0x%08lX\r\n", (unsigned long)before_read->sta);
    LOG_RAW("  read_before_read_clkcr=0x%08lX\r\n", (unsigned long)before_read->clkcr);
    LOG_RAW("  read_before_read_dctrl=0x%08lX\r\n", (unsigned long)before_read->dctrl);
    LOG_RAW("  read_before_read_dlen=%lu\r\n", (unsigned long)before_read->dlen);
    LOG_RAW("  read_before_read_dcount=%lu\r\n", (unsigned long)before_read->dcount);
    LOG_RAW("  read_before_read_fifocnt=%lu\r\n", (unsigned long)before_read->fifocnt);
    LOG_RAW("  read_before_read_power=0x%08lX\r\n", (unsigned long)before_read->power);
    LOG_RAW("  read_before_read_arg=0x%08lX\r\n", (unsigned long)before_read->arg);
    LOG_RAW("  read_before_read_cmd=0x%08lX\r\n", (unsigned long)before_read->cmd);
    LOG_RAW("  read_before_read_resp_cmd=0x%08lX\r\n", (unsigned long)before_read->resp_cmd);

    LOG_RAW("  read_after_read_sta=0x%08lX\r\n", (unsigned long)after_read->sta);
    LOG_RAW("  read_after_read_clkcr=0x%08lX\r\n", (unsigned long)after_read->clkcr);
    LOG_RAW("  read_after_read_dctrl=0x%08lX\r\n", (unsigned long)after_read->dctrl);
    LOG_RAW("  read_after_read_dlen=%lu\r\n", (unsigned long)after_read->dlen);
    LOG_RAW("  read_after_read_dcount=%lu\r\n", (unsigned long)after_read->dcount);
    LOG_RAW("  read_after_read_fifocnt=%lu\r\n", (unsigned long)after_read->fifocnt);
    LOG_RAW("  read_after_read_power=0x%08lX\r\n", (unsigned long)after_read->power);
    LOG_RAW("  read_after_read_arg=0x%08lX\r\n", (unsigned long)after_read->arg);
    LOG_RAW("  read_after_read_cmd=0x%08lX\r\n", (unsigned long)after_read->cmd);
    LOG_RAW("  read_after_read_resp_cmd=0x%08lX\r\n", (unsigned long)after_read->resp_cmd);
    LOG_RAW("  read_after_read_resp1=0x%08lX\r\n", (unsigned long)after_read->resp1);
    LOG_RAW("  read_after_read_resp2=0x%08lX\r\n", (unsigned long)after_read->resp2);
    LOG_RAW("  read_after_read_resp3=0x%08lX\r\n", (unsigned long)after_read->resp3);
    LOG_RAW("  read_after_read_resp4=0x%08lX\r\n", (unsigned long)after_read->resp4);
    LOG_RAW("  read_hal_state_before_read=%lu\r\n", (unsigned long)s_read_reg_diag.last_hal_state_before_read);
    LOG_RAW("  read_hal_state_after_read=%lu\r\n", (unsigned long)s_read_reg_diag.last_hal_state_after_read);
    LOG_RAW("  read_hal_error_after_read=0x%08lX\r\n", (unsigned long)s_read_reg_diag.last_hal_error_after_read);
    LOG_RAW("  read_after_sta_dcrc_fail=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_DCRCFAIL));
    LOG_RAW("  read_after_sta_dtimeout=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_DTIMEOUT));
    LOG_RAW("  read_after_sta_rxoverr=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_RXOVERR));
    LOG_RAW("  read_after_sta_stbiterr=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_STBITERR));
    LOG_RAW("  read_after_sta_dataend=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_DATAEND));
    LOG_RAW("  read_after_sta_dbckend=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_DBCKEND));
    LOG_RAW("  read_after_sta_cmdsent=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_CMDSENT));
    LOG_RAW("  read_after_sta_cmdrend=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_CMDREND));
    LOG_RAW("  read_after_sta_rxact=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_RXACT));
    LOG_RAW("  read_after_sta_rxdavl=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_RXDAVL));
    LOG_RAW("  read_after_sta_txunderr=%lu\r\n", (unsigned long)Camera_SDStorage_IsStaFlagSet(after_sta, SDIO_STA_TXUNDERR));
    LOG_RAW("  last_block_read_buffer_inspected=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_inspected);
    LOG_RAW("  last_block_read_buffer_len=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_len);
    LOG_RAW("  last_block_read_prefill_pattern=0x%02lX\r\n", (unsigned long)s_read_reg_diag.last_block_read_prefill_pattern);
    LOG_RAW("  last_block_read_buffer_sum512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_sum512);
    LOG_RAW("  last_block_read_buffer_xor512=0x%02lX\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_xor512);
    LOG_RAW("  last_block_read_buffer_nonzero_count512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_nonzero_count512);
    LOG_RAW("  last_block_read_buffer_zero_count512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_zero_count512);
    LOG_RAW("  last_block_read_buffer_ff_count512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_ff_count512);
    LOG_RAW("  last_block_read_buffer_prefill_count512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_prefill_count512);
    LOG_RAW("  last_block_read_buffer_changed_count512=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_changed_count512);
    LOG_RAW("  last_block_read_buffer_changed=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_changed);
    LOG_RAW("  last_block_read_buffer_all_prefill=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_all_prefill);
    LOG_RAW("  last_block_read_buffer_all_zero=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_all_zero);
    LOG_RAW("  last_block_read_buffer_all_ff=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_all_ff);
    LOG_RAW("  last_block_read_buffer_first_changed_index=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_first_changed_index);
    LOG_RAW("  last_block_read_buffer_last_changed_index=%lu\r\n", (unsigned long)s_read_reg_diag.last_block_read_buffer_last_changed_index);
    Camera_SDStorage_PrintReadBufferBytes(
        "last_block_read_buffer_first16",
        s_read_reg_diag.last_block_read_buffer_first16,
        sizeof(s_read_reg_diag.last_block_read_buffer_first16));
    Camera_SDStorage_PrintReadBufferBytes(
        "last_block_read_buffer_first32",
        s_read_reg_diag.last_block_read_buffer_first32,
        sizeof(s_read_reg_diag.last_block_read_buffer_first32));
    Camera_SDStorage_PrintReadBufferBytes(
        "last_block_read_buffer_tail16",
        s_read_reg_diag.last_block_read_buffer_tail16,
        sizeof(s_read_reg_diag.last_block_read_buffer_tail16));
}

